Revit 2027 API
ParameterTypeId.DpartMaterialIdParam Property
 "Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DpartMaterialIdParam { get; }
Public Shared ReadOnly Property DpartMaterialIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DpartMaterialIdParam {
	ForgeTypeId^ get ();
}
static member DpartMaterialIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace